# GenericSelfIllumFilterMap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Generic..::..GenericSelfIllumFilterMap Property
Generic Class See Also
---
The property labeled "Filter Color" from the "Generic" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GenericSelfIllumFilterMap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GenericSelfIllumFilterMap As String
	Get
```

Visual C++
---
```text
public:
static property String^ GenericSelfIllumFilterMap {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace